MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DX128VLH7/mcu.h
#define Reserved                      0xFFF80000000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00040000      // This read-only field is reserved and always has the value 1
#define Reserved                      0x001E0000      // This read-only field is reserved and always has the value 0
#define PORTE                         0x00002000      // Port E Clock Gate Control
#define PORTD                         0x00001000      // Port D Clock Gate Control
#define PORTC                         0x00000800      // Port C Clock Gate Control
#define PORTB                         0x00000400      // Port B Clock Gate Control
#define PORTA                         0x00000200      // Port A Clock Gate Control
#define Reserved                      0x00000300      // This read-only field is reserved and always has the value 1
#define Reserved                      0x00000040      // This read-only field is reserved and always has the value 0
#define TSI                           0x00000020      // TSI Clock Gate Control
#define Reserved                      0x00000010      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000018      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000002      // This read-only field is reserved and always has the value 1
#define LPTIMER                       0x00000001      // Low Power Timer Access Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC6 register.
//
//*****************************************************************************

#define Reserved                      0x80000000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x40000000      // This read-only field is reserved and always has the value 1
#define RTC                           0x20000000      // RTC Access Control
#define Reserved                      0x10000000      // This read-only field is reserved and always has the value 0
#define ADC0                          0x08000000      // ADC0 Clock Gate Control
#define Reserved                      0x04000000      // This read-only field is reserved and always has the value 0
#define FTM1                          0x02000000      // FTM1 Clock Gate Control
#define FTM0                          0x01000000      // FTM0 Clock Gate Control
#define PIT                           0x00800000      // PIT Clock Gate Control
#define PDB                           0x00400000      // PDB Clock Gate Control
#define Reserved                      0x00200000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00300000      // This read-only field is reserved and always has the value 0
#define CRC                           0x00040000      // CRC Clock Gate Control
#define Reserved                      0x00060000      // This read-only field is reserved and always has the value 0
#define I2S                           0x00008000      // I2S Clock Gate Control
#define Reserved                      0x00004000      // This read-only field is reserved and always has the value 0
#define SPI1                          0x00002000      // SPI1 Clock Gate Control
#define SPI0                          0x00001000      // SPI0 Clock Gate Control
#define Reserved                      0x00001800      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000200      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000F00      // This read-only field is reserved and always has the value 0
#define FLEXCAN0                      0x00000010      // FlexCAN0 Clock Gate Control
#define Reserved                      0x00000018      // This read-only field is reserved and always has the value 0
#define DMAMUX                        0x00000002      // DMA Mux Clock Gate Control
#define FTFL                          0x00000001      // Flash Memory Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC7 register.
//
//*****************************************************************************

#define Reserved                      0xFFFFFFF80000000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000004      // This read-only field is reserved and always has the value 0
#define DMA                           0x00000002      // DMA Clock Gate Control
#define FLEXBUS                       0x00000001      // FlexBus Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_CLKDIV1 register.
//
//*****************************************************************************

#define OUTDIV1                       0x780000000      // Clock 1 output divider value
#define OUTDIV2                       0x78000000      // Clock 2 output divider value
#define OUTDIV3                       0x07800000      // Clock 3 output divider value
#define OUTDIV4                       0x00780000      // Clock 4 output divider value
#define Reserved                      0x7FFF8000      // This read-only field is reserved and always has the value 0


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_CLKDIV2 register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFFF80000000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000038      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000001      // This read-only field is reserved and always has the value 0


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_FCFG1 register.
//
//*****************************************************************************

#define NVMSIZE                       0x780000000      // FlexNVM size
#define PFSIZE                        0x78000000      // Program flash size
#define Reserved                      0x07800000      // This read-only field is reserved and always has the value 0
#define EESIZE                        0x00780000      // EEPROM size
#define Reserved                      0x00078000      // This read-only field is reserved and always has the value 0
#define DEPART                        0x00007800      // FlexNVM partition
#define Reserved                      0x00001F80      // This read-only field is reserved and always has the value 0
#define FLASHDOZE                     0x00000002      // Flash Doze
#define FLASHDIS                      0x00000001      // Flash Disable
#define DEPART                        0x00007800      // FlexNVM partition


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_FCFG2 register.
//
//*****************************************************************************

#define Reserved                      0x80000000      // This read-only field is reserved and always has the value 0
#define MAXADDR0                      0x1FC0000000      // Max address block 0
#define PFLSH                         0x00800000      // Program flash
#define MAXADDR1                      0x1FC00000      // Max address block 1
#define Reserved                      0x7FFF8000      // This read-only field is reserved and always has the value 0
#define MAXADDR0                      0x1FC0000000      // Max address block 0
#define MAXADDR1                      0x1FC00000      // Max address block 1


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDH register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDMH register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDML register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDL register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification
#define UID                           0x7FFFFFFF80000000      // Unique Identification ::


//*****************************************************************************
//
// The following are defines for the bit fields in the SMC_PMCTRL register.
//
//*****************************************************************************

#define RUNM                          0x000000C0      // Run Mode Control
#define STOPA                         0x00000008      // Stop Aborted
#define STOPM                         0x0000001C      // Stop Mode Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SMC_VLLSCTRL register.
//
//*****************************************************************************

